Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/include/proc/p32mk0512mcj048.h
extern volatile __SPI2CON2bits_t SPI2CON2bits __asm__ ("SPI2CON2") __attribute__((section("sfrs"), address(0xBF827240)));
extern volatile uint32_t        SPI2CON2CLR __attribute__((section("sfrs"),address(0xBF827244)));
extern volatile uint32_t        SPI2CON2SET __attribute__((section("sfrs"),address(0xBF827248)));
extern volatile uint32_t        SPI2CON2INV __attribute__((section("sfrs"),address(0xBF82724C)));
#define U1MODE U1MODE
extern volatile uint32_t   U1MODE __attribute__((section("sfrs"), address(0xBF828000)));
typedef union {
  struct {
    uint32_t STSEL:1;
    uint32_t PDSEL:2;
    uint32_t BRGH:1;
    uint32_t RXINV:1;
    uint32_t ABAUD:1;
    uint32_t LPBACK:1;
    uint32_t WAKE:1;
    uint32_t UEN:2;
    uint32_t :1;
    uint32_t RTSMD:1;
    uint32_t IREN:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t OVFDIS:1;
    uint32_t CLKSEL:2;
    uint32_t :3;
    uint32_t ACTIVE:1;
    uint32_t SLPEN:1;
  };
  struct {
    uint32_t :16;
    uint32_t RUNOVF:1;
  };
  struct {
    uint32_t :1;
    uint32_t PDSEL0:1;
    uint32_t PDSEL1:1;
    uint32_t :5;
    uint32_t UEN0:1;
    uint32_t UEN1:1;
  };
  struct {
    uint32_t :13;
    uint32_t USIDL:1;
    uint32_t :1;
    uint32_t UARTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __U1MODEbits_t;
extern volatile __U1MODEbits_t U1MODEbits __asm__ ("U1MODE") __attribute__((section("sfrs"), address(0xBF828000)));
extern volatile uint32_t        U1MODECLR __attribute__((section("sfrs"),address(0xBF828004)));
extern volatile uint32_t        U1MODESET __attribute__((section("sfrs"),address(0xBF828008)));
extern volatile uint32_t        U1MODEINV __attribute__((section("sfrs"),address(0xBF82800C)));
#define U1STA U1STA
extern volatile uint32_t   U1STA __attribute__((section("sfrs"), address(0xBF828010)));
typedef union {
  struct {
    uint32_t URXDA:1;
    uint32_t OERR:1;
    uint32_t FERR:1;
    uint32_t PERR:1;
    uint32_t RIDLE:1;
    uint32_t ADDEN:1;
    uint32_t URXISEL:2;
    uint32_t TRMT:1;
    uint32_t UTXBF:1;
    uint32_t UTXEN:1;
    uint32_t UTXBRK:1;
    uint32_t URXEN:1;
    uint32_t UTXINV:1;
    uint32_t UTXISEL:2;
    uint32_t ADDR:8;
    uint32_t MASK:8;
  };
  struct {
    uint32_t :6;
    uint32_t URXISEL0:1;
    uint32_t URXISEL1:1;
    uint32_t :6;
    uint32_t UTXISEL0:1;
    uint32_t UTXISEL1:1;
  };
  struct {
    uint32_t :14;
    uint32_t UTXSEL:2;
  };
  struct {
    uint32_t w:32;
  };
} __U1STAbits_t;
extern volatile __U1STAbits_t U1STAbits __asm__ ("U1STA") __attribute__((section("sfrs"), address(0xBF828010)));
extern volatile uint32_t        U1STACLR __attribute__((section("sfrs"),address(0xBF828014)));
extern volatile uint32_t        U1STASET __attribute__((section("sfrs"),address(0xBF828018)));
extern volatile uint32_t        U1STAINV __attribute__((section("sfrs"),address(0xBF82801C)));
#define U1TXREG U1TXREG
extern volatile uint32_t   U1TXREG __attribute__((section("sfrs"), address(0xBF828020)));
#define U1RXREG U1RXREG
extern volatile uint32_t   U1RXREG __attribute__((section("sfrs"), address(0xBF828030)));
#define U1BRG U1BRG
extern volatile uint32_t   U1BRG __attribute__((section("sfrs"), address(0xBF828040)));
typedef struct {
  uint32_t BRG:20;
} __U1BRGbits_t;
extern volatile __U1BRGbits_t U1BRGbits __asm__ ("U1BRG") __attribute__((section("sfrs"), address(0xBF828040)));
extern volatile uint32_t        U1BRGCLR __attribute__((section("sfrs"),address(0xBF828044)));
extern volatile uint32_t        U1BRGSET __attribute__((section("sfrs"),address(0xBF828048)));
extern volatile uint32_t        U1BRGINV __attribute__((section("sfrs"),address(0xBF82804C)));
#define U2MODE U2MODE
extern volatile uint32_t   U2MODE __attribute__((section("sfrs"), address(0xBF828200)));
typedef union {
  struct {
    uint32_t STSEL:1;
    uint32_t PDSEL:2;
    uint32_t BRGH:1;
    uint32_t RXINV:1;
    uint32_t ABAUD:1;
    uint32_t LPBACK:1;
    uint32_t WAKE:1;
    uint32_t UEN:2;
    uint32_t :1;
    uint32_t RTSMD:1;
    uint32_t IREN:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t OVFDIS:1;
    uint32_t CLKSEL:2;
    uint32_t :3;
    uint32_t ACTIVE:1;
    uint32_t SLPEN:1;
  };
  struct {
    uint32_t :16;
    uint32_t RUNOVF:1;
  };
  struct {
    uint32_t :1;
    uint32_t PDSEL0:1;
    uint32_t PDSEL1:1;
    uint32_t :5;
    uint32_t UEN0:1;
    uint32_t UEN1:1;
  };
  struct {
    uint32_t :13;
    uint32_t USIDL:1;
    uint32_t :1;
    uint32_t UARTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __U2MODEbits_t;
extern volatile __U2MODEbits_t U2MODEbits __asm__ ("U2MODE") __attribute__((section("sfrs"), address(0xBF828200)));
extern volatile uint32_t        U2MODECLR __attribute__((section("sfrs"),address(0xBF828204)));
extern volatile uint32_t        U2MODESET __attribute__((section("sfrs"),address(0xBF828208)));
extern volatile uint32_t        U2MODEINV __attribute__((section("sfrs"),address(0xBF82820C)));
#define U2STA U2STA
extern volatile uint32_t   U2STA __attribute__((section("sfrs"), address(0xBF828210)));
typedef union {
  struct {
    uint32_t URXDA:1;
    uint32_t OERR:1;
    uint32_t FERR:1;
    uint32_t PERR:1;
    uint32_t RIDLE:1;
    uint32_t ADDEN:1;
    uint32_t URXISEL:2;
    uint32_t TRMT:1;
    uint32_t UTXBF:1;
    uint32_t UTXEN:1;
    uint32_t UTXBRK:1;
    uint32_t URXEN:1;
    uint32_t UTXINV:1;
    uint32_t UTXISEL:2;
    uint32_t ADDR:8;
    uint32_t MASK:8;
  };
  struct {
    uint32_t :6;
    uint32_t URXISEL0:1;
    uint32_t URXISEL1:1;
    uint32_t :6;
    uint32_t UTXISEL0:1;
    uint32_t UTXISEL1:1;
  };
  struct {
    uint32_t :14;
    uint32_t UTXSEL:2;
  };
  struct {
    uint32_t w:32;
  };
} __U2STAbits_t;
extern volatile __U2STAbits_t U2STAbits __asm__ ("U2STA") __attribute__((section("sfrs"), address(0xBF828210)));
extern volatile uint32_t        U2STACLR __attribute__((section("sfrs"),address(0xBF828214)));
extern volatile uint32_t        U2STASET __attribute__((section("sfrs"),address(0xBF828218)));
extern volatile uint32_t        U2STAINV __attribute__((section("sfrs"),address(0xBF82821C)));
#define U2TXREG U2TXREG
extern volatile uint32_t   U2TXREG __attribute__((section("sfrs"), address(0xBF828220)));
#define U2RXREG U2RXREG
extern volatile uint32_t   U2RXREG __attribute__((section("sfrs"), address(0xBF828230)));
#define U2BRG U2BRG
extern volatile uint32_t   U2BRG __attribute__((section("sfrs"), address(0xBF828240)));
typedef struct {
  uint32_t BRG:20;
} __U2BRGbits_t;
extern volatile __U2BRGbits_t U2BRGbits __asm__ ("U2BRG") __attribute__((section("sfrs"), address(0xBF828240)));
extern volatile uint32_t        U2BRGCLR __attribute__((section("sfrs"),address(0xBF828244)));
extern volatile uint32_t        U2BRGSET __attribute__((section("sfrs"),address(0xBF828248)));
extern volatile uint32_t        U2BRGINV __attribute__((section("sfrs"),address(0xBF82824C)));
#define PTCON PTCON
extern volatile uint32_t   PTCON __attribute__((section("sfrs"), address(0xBF82A000)));
typedef struct {
  uint32_t SEVTPS:4;
  uint32_t PCLKDIV:3;
  uint32_t :3;
  uint32_t PWMRDY:1;
  uint32_t SEIEN:1;
  uint32_t SESTAT:1;
  uint32_t PTSIDL:1;
  uint32_t :1;
  uint32_t PTEN:1;
} __PTCONbits_t;
extern volatile __PTCONbits_t PTCONbits __asm__ ("PTCON") __attribute__((section("sfrs"), address(0xBF82A000)));
extern volatile uint32_t        PTCONCLR __attribute__((section("sfrs"),address(0xBF82A004)));
extern volatile uint32_t        PTCONSET __attribute__((section("sfrs"),address(0xBF82A008)));
extern volatile uint32_t        PTCONINV __attribute__((section("sfrs"),address(0xBF82A00C)));
#define PTPER PTPER
extern volatile uint32_t   PTPER __attribute__((section("sfrs"), address(0xBF82A010)));
typedef struct {
  uint32_t PTPER:16;
} __PTPERbits_t;
extern volatile __PTPERbits_t PTPERbits __asm__ ("PTPER") __attribute__((section("sfrs"), address(0xBF82A010)));
extern volatile uint32_t        PTPERCLR __attribute__((section("sfrs"),address(0xBF82A014)));
extern volatile uint32_t        PTPERSET __attribute__((section("sfrs"),address(0xBF82A018)));
extern volatile uint32_t        PTPERINV __attribute__((section("sfrs"),address(0xBF82A01C)));
#define SEVTCMP SEVTCMP
extern volatile uint32_t   SEVTCMP __attribute__((section("sfrs"), address(0xBF82A020)));
typedef struct {
  uint32_t SEVTCMP:16;
} __SEVTCMPbits_t;
extern volatile __SEVTCMPbits_t SEVTCMPbits __asm__ ("SEVTCMP") __attribute__((section("sfrs"), address(0xBF82A020)));
extern volatile uint32_t        SEVTCMPCLR __attribute__((section("sfrs"),address(0xBF82A024)));
extern volatile uint32_t        SEVTCMPSET __attribute__((section("sfrs"),address(0xBF82A028)));
extern volatile uint32_t        SEVTCMPINV __attribute__((section("sfrs"),address(0xBF82A02C)));
#define PMTMR PMTMR
extern volatile uint32_t   PMTMR __attribute__((section("sfrs"), address(0xBF82A030)));
typedef struct {
  uint32_t PMTMR:16;
} __PMTMRbits_t;
