Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/include/proc/p32mk0512mcj048.h
extern volatile __CFD1FLTOBJ20bits_t CFD1FLTOBJ20bits __asm__ ("CFD1FLTOBJ20") __attribute__((section("sfrs"), address(0xBF880A40)));
extern volatile uint32_t        CFD1FLTOBJ20CLR __attribute__((section("sfrs"),address(0xBF880A44)));
extern volatile uint32_t        CFD1FLTOBJ20SET __attribute__((section("sfrs"),address(0xBF880A48)));
extern volatile uint32_t        CFD1FLTOBJ20INV __attribute__((section("sfrs"),address(0xBF880A4C)));
#define CFD1MASK20 CFD1MASK20
extern volatile uint32_t   CFD1MASK20 __attribute__((section("sfrs"), address(0xBF880A50)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK20bits_t;
extern volatile __CFD1MASK20bits_t CFD1MASK20bits __asm__ ("CFD1MASK20") __attribute__((section("sfrs"), address(0xBF880A50)));
extern volatile uint32_t        CFD1MASK20CLR __attribute__((section("sfrs"),address(0xBF880A54)));
extern volatile uint32_t        CFD1MASK20SET __attribute__((section("sfrs"),address(0xBF880A58)));
extern volatile uint32_t        CFD1MASK20INV __attribute__((section("sfrs"),address(0xBF880A5C)));
#define CFD1FLTOBJ21 CFD1FLTOBJ21
extern volatile uint32_t   CFD1FLTOBJ21 __attribute__((section("sfrs"), address(0xBF880A60)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ21bits_t;
extern volatile __CFD1FLTOBJ21bits_t CFD1FLTOBJ21bits __asm__ ("CFD1FLTOBJ21") __attribute__((section("sfrs"), address(0xBF880A60)));
extern volatile uint32_t        CFD1FLTOBJ21CLR __attribute__((section("sfrs"),address(0xBF880A64)));
extern volatile uint32_t        CFD1FLTOBJ21SET __attribute__((section("sfrs"),address(0xBF880A68)));
extern volatile uint32_t        CFD1FLTOBJ21INV __attribute__((section("sfrs"),address(0xBF880A6C)));
#define CFD1MASK21 CFD1MASK21
extern volatile uint32_t   CFD1MASK21 __attribute__((section("sfrs"), address(0xBF880A70)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK21bits_t;
extern volatile __CFD1MASK21bits_t CFD1MASK21bits __asm__ ("CFD1MASK21") __attribute__((section("sfrs"), address(0xBF880A70)));
extern volatile uint32_t        CFD1MASK21CLR __attribute__((section("sfrs"),address(0xBF880A74)));
extern volatile uint32_t        CFD1MASK21SET __attribute__((section("sfrs"),address(0xBF880A78)));
extern volatile uint32_t        CFD1MASK21INV __attribute__((section("sfrs"),address(0xBF880A7C)));
#define CFD1FLTOBJ22 CFD1FLTOBJ22
extern volatile uint32_t   CFD1FLTOBJ22 __attribute__((section("sfrs"), address(0xBF880A80)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ22bits_t;
extern volatile __CFD1FLTOBJ22bits_t CFD1FLTOBJ22bits __asm__ ("CFD1FLTOBJ22") __attribute__((section("sfrs"), address(0xBF880A80)));
extern volatile uint32_t        CFD1FLTOBJ22CLR __attribute__((section("sfrs"),address(0xBF880A84)));
extern volatile uint32_t        CFD1FLTOBJ22SET __attribute__((section("sfrs"),address(0xBF880A88)));
extern volatile uint32_t        CFD1FLTOBJ22INV __attribute__((section("sfrs"),address(0xBF880A8C)));
#define CFD1MASK22 CFD1MASK22
extern volatile uint32_t   CFD1MASK22 __attribute__((section("sfrs"), address(0xBF880A90)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK22bits_t;
extern volatile __CFD1MASK22bits_t CFD1MASK22bits __asm__ ("CFD1MASK22") __attribute__((section("sfrs"), address(0xBF880A90)));
extern volatile uint32_t        CFD1MASK22CLR __attribute__((section("sfrs"),address(0xBF880A94)));
extern volatile uint32_t        CFD1MASK22SET __attribute__((section("sfrs"),address(0xBF880A98)));
extern volatile uint32_t        CFD1MASK22INV __attribute__((section("sfrs"),address(0xBF880A9C)));
#define CFD1FLTOBJ23 CFD1FLTOBJ23
extern volatile uint32_t   CFD1FLTOBJ23 __attribute__((section("sfrs"), address(0xBF880AA0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ23bits_t;
extern volatile __CFD1FLTOBJ23bits_t CFD1FLTOBJ23bits __asm__ ("CFD1FLTOBJ23") __attribute__((section("sfrs"), address(0xBF880AA0)));
extern volatile uint32_t        CFD1FLTOBJ23CLR __attribute__((section("sfrs"),address(0xBF880AA4)));
extern volatile uint32_t        CFD1FLTOBJ23SET __attribute__((section("sfrs"),address(0xBF880AA8)));
extern volatile uint32_t        CFD1FLTOBJ23INV __attribute__((section("sfrs"),address(0xBF880AAC)));
#define CFD1MASK23 CFD1MASK23
extern volatile uint32_t   CFD1MASK23 __attribute__((section("sfrs"), address(0xBF880AB0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK23bits_t;
extern volatile __CFD1MASK23bits_t CFD1MASK23bits __asm__ ("CFD1MASK23") __attribute__((section("sfrs"), address(0xBF880AB0)));
extern volatile uint32_t        CFD1MASK23CLR __attribute__((section("sfrs"),address(0xBF880AB4)));
extern volatile uint32_t        CFD1MASK23SET __attribute__((section("sfrs"),address(0xBF880AB8)));
extern volatile uint32_t        CFD1MASK23INV __attribute__((section("sfrs"),address(0xBF880ABC)));
#define CFD1FLTOBJ24 CFD1FLTOBJ24
extern volatile uint32_t   CFD1FLTOBJ24 __attribute__((section("sfrs"), address(0xBF880AC0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ24bits_t;
extern volatile __CFD1FLTOBJ24bits_t CFD1FLTOBJ24bits __asm__ ("CFD1FLTOBJ24") __attribute__((section("sfrs"), address(0xBF880AC0)));
extern volatile uint32_t        CFD1FLTOBJ24CLR __attribute__((section("sfrs"),address(0xBF880AC4)));
extern volatile uint32_t        CFD1FLTOBJ24SET __attribute__((section("sfrs"),address(0xBF880AC8)));
extern volatile uint32_t        CFD1FLTOBJ24INV __attribute__((section("sfrs"),address(0xBF880ACC)));
#define CFD1MASK24 CFD1MASK24
extern volatile uint32_t   CFD1MASK24 __attribute__((section("sfrs"), address(0xBF880AD0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK24bits_t;
extern volatile __CFD1MASK24bits_t CFD1MASK24bits __asm__ ("CFD1MASK24") __attribute__((section("sfrs"), address(0xBF880AD0)));
extern volatile uint32_t        CFD1MASK24CLR __attribute__((section("sfrs"),address(0xBF880AD4)));
extern volatile uint32_t        CFD1MASK24SET __attribute__((section("sfrs"),address(0xBF880AD8)));
extern volatile uint32_t        CFD1MASK24INV __attribute__((section("sfrs"),address(0xBF880ADC)));
#define CFD1FLTOBJ25 CFD1FLTOBJ25
extern volatile uint32_t   CFD1FLTOBJ25 __attribute__((section("sfrs"), address(0xBF880AE0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ25bits_t;
extern volatile __CFD1FLTOBJ25bits_t CFD1FLTOBJ25bits __asm__ ("CFD1FLTOBJ25") __attribute__((section("sfrs"), address(0xBF880AE0)));
extern volatile uint32_t        CFD1FLTOBJ25CLR __attribute__((section("sfrs"),address(0xBF880AE4)));
extern volatile uint32_t        CFD1FLTOBJ25SET __attribute__((section("sfrs"),address(0xBF880AE8)));
extern volatile uint32_t        CFD1FLTOBJ25INV __attribute__((section("sfrs"),address(0xBF880AEC)));
#define CFD1MASK25 CFD1MASK25
extern volatile uint32_t   CFD1MASK25 __attribute__((section("sfrs"), address(0xBF880AF0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK25bits_t;
