Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/include/proc/p32mk0512mcj048.h
extern volatile __DEVADC3bits_t DEVADC3bits __asm__ ("DEVADC3") __attribute__((section("sfrs"), address(0xBFC4500C)));
#define DEVADC4 DEVADC4
extern volatile uint32_t   DEVADC4 __attribute__((section("sfrs"), address(0xBFC45010)));
typedef union {
  struct {
    uint32_t ADCCALDATA:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVADC4bits_t;
extern volatile __DEVADC4bits_t DEVADC4bits __asm__ ("DEVADC4") __attribute__((section("sfrs"), address(0xBFC45010)));
#define DEVADC5 DEVADC5
extern volatile uint32_t   DEVADC5 __attribute__((section("sfrs"), address(0xBFC45014)));
typedef union {
  struct {
    uint32_t ADCCALDATA:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVADC5bits_t;
extern volatile __DEVADC5bits_t DEVADC5bits __asm__ ("DEVADC5") __attribute__((section("sfrs"), address(0xBFC45014)));
#define DEVADC7 DEVADC7
extern volatile uint32_t   DEVADC7 __attribute__((section("sfrs"), address(0xBFC45018)));
typedef union {
  struct {
    uint32_t ADCCALDATA:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVADC7bits_t;
extern volatile __DEVADC7bits_t DEVADC7bits __asm__ ("DEVADC7") __attribute__((section("sfrs"), address(0xBFC45018)));
#define DEVSN0 DEVSN0
extern volatile uint32_t   DEVSN0 __attribute__((section("sfrs"), address(0xBFC45020)));
typedef union {
  struct {
    uint32_t SN:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVSN0bits_t;
extern volatile __DEVSN0bits_t DEVSN0bits __asm__ ("DEVSN0") __attribute__((section("sfrs"), address(0xBFC45020)));
#define DEVSN1 DEVSN1
extern volatile uint32_t   DEVSN1 __attribute__((section("sfrs"), address(0xBFC45024)));
typedef union {
  struct {
    uint32_t SN:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVSN1bits_t;
extern volatile __DEVSN1bits_t DEVSN1bits __asm__ ("DEVSN1") __attribute__((section("sfrs"), address(0xBFC45024)));
#define DEVSN2 DEVSN2
extern volatile uint32_t   DEVSN2 __attribute__((section("sfrs"), address(0xBFC45028)));
typedef union {
  struct {
    uint32_t SN:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVSN2bits_t;
extern volatile __DEVSN2bits_t DEVSN2bits __asm__ ("DEVSN2") __attribute__((section("sfrs"), address(0xBFC45028)));
#define DEVSN3 DEVSN3
extern volatile uint32_t   DEVSN3 __attribute__((section("sfrs"), address(0xBFC4502C)));
typedef union {
  struct {
    uint32_t SN:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVSN3bits_t;
extern volatile __DEVSN3bits_t DEVSN3bits __asm__ ("DEVSN3") __attribute__((section("sfrs"), address(0xBFC4502C)));
#define ADEVCFG3 ADEVCFG3
extern volatile uint32_t   ADEVCFG3 __attribute__((section("sfrs"), address(0xBFC03F40)));
typedef union {
  struct {
    uint32_t USERID:16;
    uint32_t :4;
    uint32_t PWMLOCK:1;
    uint32_t :6;
    uint32_t PGL1WAY:1;
    uint32_t PMDL1WAY:1;
    uint32_t IOL1WAY:1;
    uint32_t FUSBIDIO1:1;
    uint32_t FVBUSIO1:1;
  };
  struct {
    uint32_t w:32;
  };
} __ADEVCFG3bits_t;
extern volatile __ADEVCFG3bits_t ADEVCFG3bits __asm__ ("ADEVCFG3") __attribute__((section("sfrs"), address(0xBFC03F40)));
#define ADEVCFG2 ADEVCFG2
extern volatile uint32_t   ADEVCFG2 __attribute__((section("sfrs"), address(0xBFC03F44)));
typedef union {
  struct {
    uint32_t FPLLIDIV:3;
    uint32_t :1;
    uint32_t FPLLRNG:3;
    uint32_t FPLLICLK:1;
    uint32_t FPLLMULT:7;
    uint32_t :1;
    uint32_t FPLLODIV:3;
    uint32_t :1;
    uint32_t DSBOREN:1;
    uint32_t DSWDTPS:5;
    uint32_t DSWDTOSC:1;
    uint32_t DSWDTEN:1;
    uint32_t FDSEN:1;
    uint32_t BORSEL:1;
    uint32_t :1;
    uint32_t UPLLEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __ADEVCFG2bits_t;
extern volatile __ADEVCFG2bits_t ADEVCFG2bits __asm__ ("ADEVCFG2") __attribute__((section("sfrs"), address(0xBFC03F44)));
#define ADEVCFG1 ADEVCFG1
extern volatile uint32_t   ADEVCFG1 __attribute__((section("sfrs"), address(0xBFC03F48)));
typedef union {
  struct {
    uint32_t FNOSC:3;
    uint32_t DMTINTV:3;
    uint32_t FSOSCEN:1;
    uint32_t IESO:1;
    uint32_t POSCMOD:2;
    uint32_t OSCIOFNC:1;
    uint32_t :3;
    uint32_t FCKSM:2;
    uint32_t WDTPS:5;
    uint32_t WDTSPGM:1;
    uint32_t WINDIS:1;
    uint32_t FWDTEN:1;
    uint32_t FWDTWINSZ:2;
    uint32_t DMTCNT:5;
    uint32_t FDMTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __ADEVCFG1bits_t;
extern volatile __ADEVCFG1bits_t ADEVCFG1bits __asm__ ("ADEVCFG1") __attribute__((section("sfrs"), address(0xBFC03F48)));
#define ADEVCFG0 ADEVCFG0
extern volatile uint32_t   ADEVCFG0 __attribute__((section("sfrs"), address(0xBFC03F4C)));
typedef union {
  struct {
    uint32_t DEBUG:2;
    uint32_t JTAGEN:1;
    uint32_t ICESEL:2;
    uint32_t TRCEN:1;
    uint32_t BOOTISA:1;
    uint32_t :1;
    uint32_t FECCCON:2;
    uint32_t FSLEEP:1;
    uint32_t :1;
    uint32_t DBGPER:3;
    uint32_t SMCLR:1;
    uint32_t SOSCGAIN:2;
    uint32_t SOSCBOOST:1;
    uint32_t POSCGAIN:2;
    uint32_t POSCBOOST:1;
    uint32_t POSCFGAIN:2;
    uint32_t POSCAGCDLY:2;
    uint32_t POSCAGCRNG:1;
    uint32_t POSCAGC:1;
    uint32_t :2;
    uint32_t EJTAGBEN:1;
  };
  struct {
    uint32_t FDEBUG:2;
  };
  struct {
    uint32_t w:32;
  };
} __ADEVCFG0bits_t;
extern volatile __ADEVCFG0bits_t ADEVCFG0bits __asm__ ("ADEVCFG0") __attribute__((section("sfrs"), address(0xBFC03F4C)));
#define ADEVCP ADEVCP
extern volatile uint32_t   ADEVCP __attribute__((section("sfrs"), address(0xBFC03F5C)));
typedef union {
  struct {
    uint32_t :28;
    uint32_t CP:1;
  };
  struct {
    uint32_t w:32;
  };
} __ADEVCPbits_t;
extern volatile __ADEVCPbits_t ADEVCPbits __asm__ ("ADEVCP") __attribute__((section("sfrs"), address(0xBFC03F5C)));
#define ADEVSIGN ADEVSIGN
extern volatile uint32_t   ADEVSIGN __attribute__((section("sfrs"), address(0xBFC03F6C)));
#define ASEQ ASEQ
extern volatile uint32_t   ASEQ __attribute__((section("sfrs"), address(0xBFC03F70)));
typedef union {
  struct {
    uint32_t TSEQ:16;
    uint32_t CSEQ:16;
  };
  struct {
    uint32_t w:32;
  };
} __ASEQbits_t;
extern volatile __ASEQbits_t ASEQbits __asm__ ("ASEQ") __attribute__((section("sfrs"), address(0xBFC03F70)));
#define ABF1DEVCFG3 ABF1DEVCFG3
extern volatile uint32_t   ABF1DEVCFG3 __attribute__((section("sfrs"), address(0xBFC43F40)));
typedef union {
  struct {
    uint32_t USERID:16;
    uint32_t :4;
    uint32_t PWMLOCK:1;
    uint32_t :6;
    uint32_t PGL1WAY:1;
    uint32_t PMDL1WAY:1;
    uint32_t IOL1WAY:1;
    uint32_t FUSBIDIO1:1;
    uint32_t FVBUSIO1:1;
  };
  struct {
    uint32_t w:32;
  };
} __ABF1DEVCFG3bits_t;
