Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/include/proc/p32mk0512mcj048.h
  .extern ADC0CFGCLR       /* 0xBF887D04 */
  .extern ADC0CFGSET       /* 0xBF887D08 */
  .extern ADC0CFGINV       /* 0xBF887D0C */
  .extern ADC1CFG          /* 0xBF887D10 */
  .extern ADC1CFGCLR       /* 0xBF887D14 */
  .extern ADC1CFGSET       /* 0xBF887D18 */
  .extern ADC1CFGINV       /* 0xBF887D1C */
  .extern ADC2CFG          /* 0xBF887D20 */
  .extern ADC2CFGCLR       /* 0xBF887D24 */
  .extern ADC2CFGSET       /* 0xBF887D28 */
  .extern ADC2CFGINV       /* 0xBF887D2C */
  .extern ADC3CFG          /* 0xBF887D30 */
  .extern ADC3CFGCLR       /* 0xBF887D34 */
  .extern ADC3CFGSET       /* 0xBF887D38 */
  .extern ADC3CFGINV       /* 0xBF887D3C */
  .extern ADC4CFG          /* 0xBF887D40 */
  .extern ADC4CFGCLR       /* 0xBF887D44 */
  .extern ADC4CFGSET       /* 0xBF887D48 */
  .extern ADC4CFGINV       /* 0xBF887D4C */
  .extern ADC5CFG          /* 0xBF887D50 */
  .extern ADC5CFGCLR       /* 0xBF887D54 */
  .extern ADC5CFGSET       /* 0xBF887D58 */
  .extern ADC5CFGINV       /* 0xBF887D5C */
  .extern ADC6CFG          /* 0xBF887D60 */
  .extern ADC6CFGCLR       /* 0xBF887D64 */
  .extern ADC6CFGSET       /* 0xBF887D68 */
  .extern ADC6CFGINV       /* 0xBF887D6C */
  .extern ADC7CFG          /* 0xBF887D70 */
  .extern ADC7CFGCLR       /* 0xBF887D74 */
  .extern ADC7CFGSET       /* 0xBF887D78 */
  .extern ADC7CFGINV       /* 0xBF887D7C */
  .extern ADCSYSCFG0       /* 0xBF887E00 */
  .extern ADCSYSCFG0CLR    /* 0xBF887E04 */
  .extern ADCSYSCFG0SET    /* 0xBF887E08 */
  .extern ADCSYSCFG0INV    /* 0xBF887E0C */
  .extern ADCSYSCFG1       /* 0xBF887E10 */
  .extern ADCSYSCFG1CLR    /* 0xBF887E14 */
  .extern ADCSYSCFG1SET    /* 0xBF887E18 */
  .extern ADCSYSCFG1INV    /* 0xBF887E1C */
  .extern RTCCON           /* 0xBF8C0000 */
  .extern RTCCONCLR        /* 0xBF8C0004 */
  .extern RTCCONSET        /* 0xBF8C0008 */
  .extern RTCCONINV        /* 0xBF8C000C */
  .extern RTCALRM          /* 0xBF8C0010 */
  .extern RTCALRMCLR       /* 0xBF8C0014 */
  .extern RTCALRMSET       /* 0xBF8C0018 */
  .extern RTCALRMINV       /* 0xBF8C001C */
  .extern RTCTIME          /* 0xBF8C0020 */
  .extern RTCTIMECLR       /* 0xBF8C0024 */
  .extern RTCTIMESET       /* 0xBF8C0028 */
  .extern RTCTIMEINV       /* 0xBF8C002C */
  .extern RTCDATE          /* 0xBF8C0030 */
  .extern RTCDATECLR       /* 0xBF8C0034 */
  .extern RTCDATESET       /* 0xBF8C0038 */
  .extern RTCDATEINV       /* 0xBF8C003C */
  .extern ALRMTIME         /* 0xBF8C0040 */
  .extern ALRMTIMECLR      /* 0xBF8C0044 */
  .extern ALRMTIMESET      /* 0xBF8C0048 */
  .extern ALRMTIMEINV      /* 0xBF8C004C */
  .extern ALRMDATE         /* 0xBF8C0050 */
  .extern ALRMDATECLR      /* 0xBF8C0054 */
  .extern ALRMDATESET      /* 0xBF8C0058 */
  .extern ALRMDATEINV      /* 0xBF8C005C */
  .extern DSCON            /* 0xBF8C0200 */
  .extern DSWAKE           /* 0xBF8C0204 */
  .extern DSGPR0           /* 0xBF8C0208 */
  .extern DSGPR1           /* 0xBF8C0210 */
  .extern DSGPR2           /* 0xBF8C0214 */
  .extern DSGPR3           /* 0xBF8C0218 */
  .extern DSGPR4           /* 0xBF8C021C */
  .extern DSGPR5           /* 0xBF8C0220 */
  .extern DSGPR6           /* 0xBF8C0224 */
  .extern DSGPR7           /* 0xBF8C0228 */
  .extern DSGPR8           /* 0xBF8C022C */
  .extern DSGPR9           /* 0xBF8C0230 */
  .extern DSGPR10          /* 0xBF8C0234 */
  .extern DSGPR11          /* 0xBF8C0238 */
  .extern DSGPR12          /* 0xBF8C023C */
  .extern DSGPR13          /* 0xBF8C0240 */
  .extern DSGPR14          /* 0xBF8C0244 */
  .extern DSGPR15          /* 0xBF8C0248 */
  .extern DSGPR16          /* 0xBF8C024C */
  .extern DSGPR17          /* 0xBF8C0250 */
  .extern DSGPR18          /* 0xBF8C0254 */
  .extern DSGPR19          /* 0xBF8C0258 */
  .extern DSGPR20          /* 0xBF8C025C */
  .extern DSGPR21          /* 0xBF8C0260 */
  .extern DSGPR22          /* 0xBF8C0264 */
  .extern DSGPR23          /* 0xBF8C0268 */
  .extern DSGPR24          /* 0xBF8C026C */
  .extern DSGPR25          /* 0xBF8C0270 */
  .extern DSGPR26          /* 0xBF8C0274 */
  .extern DSGPR27          /* 0xBF8C0278 */
  .extern DSGPR28          /* 0xBF8C027C */
  .extern DSGPR29          /* 0xBF8C0280 */
  .extern DSGPR30          /* 0xBF8C0284 */
  .extern DSGPR31          /* 0xBF8C0288 */
  .extern DSGPR32          /* 0xBF8C028C */
  .extern SBFLAG           /* 0xBF8F0510 */
  .extern SBT0ELOG1        /* 0xBF8F8020 */
  .extern SBT0ELOG2        /* 0xBF8F8024 */
  .extern SBT0ECON         /* 0xBF8F8028 */
  .extern SBT0ECLRS        /* 0xBF8F8030 */
  .extern SBT0ECLRM        /* 0xBF8F8038 */
  .extern SBT0REG0         /* 0xBF8F8040 */
  .extern SBT0RD0          /* 0xBF8F8050 */
  .extern SBT0WR0          /* 0xBF8F8058 */
  .extern SBT0REG1         /* 0xBF8F8060 */
  .extern SBT0RD1          /* 0xBF8F8070 */
  .extern SBT0WR1          /* 0xBF8F8078 */
  .extern SBT1ELOG1        /* 0xBF8F8420 */
  .extern SBT1ELOG2        /* 0xBF8F8424 */
  .extern SBT1ECON         /* 0xBF8F8428 */
  .extern SBT1ECLRS        /* 0xBF8F8430 */
  .extern SBT1ECLRM        /* 0xBF8F8438 */
  .extern SBT1REG0         /* 0xBF8F8440 */
  .extern SBT1RD0          /* 0xBF8F8450 */
  .extern SBT1WR0          /* 0xBF8F8458 */
  .extern SBT1REG2         /* 0xBF8F8480 */
  .extern SBT1RD2          /* 0xBF8F8490 */
  .extern SBT1WR2          /* 0xBF8F8498 */
  .extern SBT1REG3         /* 0xBF8F84A0 */
  .extern SBT1RD3          /* 0xBF8F84B0 */
  .extern SBT1WR3          /* 0xBF8F84B8 */
  .extern SBT1REG4         /* 0xBF8F84C0 */
  .extern SBT1RD4          /* 0xBF8F84D0 */
  .extern SBT1WR4          /* 0xBF8F84D8 */
  .extern SBT1REG5         /* 0xBF8F84E0 */
  .extern SBT1RD5          /* 0xBF8F84F0 */
  .extern SBT1WR5          /* 0xBF8F84F8 */
  .extern SBT1REG6         /* 0xBF8F8500 */
  .extern SBT1RD6          /* 0xBF8F8510 */
  .extern SBT1WR6          /* 0xBF8F8518 */
  .extern SBT1REG7         /* 0xBF8F8520 */
  .extern SBT1RD7          /* 0xBF8F8530 */
  .extern SBT1WR7          /* 0xBF8F8538 */
  .extern SBT1REG8         /* 0xBF8F8540 */
  .extern SBT1RD8          /* 0xBF8F8550 */
  .extern SBT1WR8          /* 0xBF8F8558 */
  .extern SBT2ELOG1        /* 0xBF8F8820 */
  .extern SBT2ELOG2        /* 0xBF8F8824 */
  .extern SBT2ECON         /* 0xBF8F8828 */
  .extern SBT2ECLRS        /* 0xBF8F8830 */
  .extern SBT2ECLRM        /* 0xBF8F8838 */
  .extern SBT2REG0         /* 0xBF8F8840 */
  .extern SBT2RD0          /* 0xBF8F8850 */
  .extern SBT2WR0          /* 0xBF8F8858 */
  .extern SBT2REG1         /* 0xBF8F8860 */
  .extern SBT2RD1          /* 0xBF8F8870 */
  .extern SBT2WR1          /* 0xBF8F8878 */
  .extern SBT2REG2         /* 0xBF8F8880 */
  .extern SBT2RD2          /* 0xBF8F8890 */
  .extern SBT2WR2          /* 0xBF8F8898 */
  .extern SBT3ELOG1        /* 0xBF8F8C20 */
  .extern SBT3ELOG2        /* 0xBF8F8C24 */
  .extern SBT3ECON         /* 0xBF8F8C28 */
  .extern SBT3ECLRS        /* 0xBF8F8C30 */
  .extern SBT3ECLRM        /* 0xBF8F8C38 */
  .extern SBT3REG0         /* 0xBF8F8C40 */
  .extern SBT3RD0          /* 0xBF8F8C50 */
  .extern SBT3WR0          /* 0xBF8F8C58 */
  .extern SBT3REG1         /* 0xBF8F8C60 */
  .extern SBT3RD1          /* 0xBF8F8C70 */
  .extern SBT3WR1          /* 0xBF8F8C78 */
  .extern SBT3REG2         /* 0xBF8F8C80 */
  .extern SBT3RD2          /* 0xBF8F8C90 */
  .extern SBT3WR2          /* 0xBF8F8C98 */
  .extern DEVCFG3          /* 0xBFC03FC0 */
  .extern DEVCFG2          /* 0xBFC03FC4 */
  .extern DEVCFG1          /* 0xBFC03FC8 */
  .extern DEVCFG0          /* 0xBFC03FCC */
  .extern DEVCP            /* 0xBFC03FDC */
  .extern DEVSIGN          /* 0xBFC03FEC */
  .extern SEQ              /* 0xBFC03FF0 */
  .extern DEVADC0          /* 0xBFC45000 */
  .extern DEVADC1          /* 0xBFC45004 */
  .extern DEVADC2          /* 0xBFC45008 */
  .extern DEVADC3          /* 0xBFC4500C */
  .extern DEVADC4          /* 0xBFC45010 */
  .extern DEVADC5          /* 0xBFC45014 */
  .extern DEVADC7          /* 0xBFC45018 */
  .extern DEVSN0           /* 0xBFC45020 */
  .extern DEVSN1           /* 0xBFC45024 */
  .extern DEVSN2           /* 0xBFC45028 */
  .extern DEVSN3           /* 0xBFC4502C */
  .extern ADEVCFG3         /* 0xBFC03F40 */
  .extern ADEVCFG2         /* 0xBFC03F44 */
  .extern ADEVCFG1         /* 0xBFC03F48 */
  .extern ADEVCFG0         /* 0xBFC03F4C */
  .extern ADEVCP           /* 0xBFC03F5C */
  .extern ADEVSIGN         /* 0xBFC03F6C */
  .extern ASEQ             /* 0xBFC03F70 */
  .extern ABF1DEVCFG3      /* 0xBFC43F40 */
  .extern ABF1DEVCFG2      /* 0xBFC43F44 */
  .extern ABF1DEVCFG1      /* 0xBFC43F48 */
  .extern ABF1DEVCFG0      /* 0xBFC43F4C */
  .extern ABF1DEVCP        /* 0xBFC43F5C */
  .extern ABF1DEVSIGN      /* 0xBFC43F6C */
  .extern ABF1SEQ          /* 0xBFC43F70 */
  .extern BF1DEVCFG3       /* 0xBFC43FC0 */
  .extern BF1DEVCFG2       /* 0xBFC43FC4 */
  .extern BF1DEVCFG1       /* 0xBFC43FC8 */
  .extern BF1DEVCFG0       /* 0xBFC43FCC */
  .extern BF1DEVCP         /* 0xBFC43FDC */
  .extern BF1DEVSIGN       /* 0xBFC43FEC */
  .extern BF1SEQ           /* 0xBFC43FF0 */
#else
#error Unknown language!
#endif

#define _CFGCON_TDOEN_POSITION                   0x00000000
#define _CFGCON_TDOEN_MASK                       0x00000001
#define _CFGCON_TDOEN_LENGTH                     0x00000001

#define _CFGCON_TROEN_POSITION                   0x00000002
#define _CFGCON_TROEN_MASK                       0x00000004
#define _CFGCON_TROEN_LENGTH                     0x00000001

#define _CFGCON_JTAGEN_POSITION                  0x00000003
#define _CFGCON_JTAGEN_MASK                      0x00000008
#define _CFGCON_JTAGEN_LENGTH                    0x00000001

#define _CFGCON_ECCCON_POSITION                  0x00000004
#define _CFGCON_ECCCON_MASK                      0x00000030
#define _CFGCON_ECCCON_LENGTH                    0x00000002

#define _CFGCON_IOANCPEN_POSITION                0x00000007
#define _CFGCON_IOANCPEN_MASK                    0x00000080
#define _CFGCON_IOANCPEN_LENGTH                  0x00000001

