Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/include/proc/p32mk0512mcj048.h
#define _IPC12_CNFIS_POSITION                    0x00000008
#define _IPC12_CNFIS_MASK                        0x00000300
#define _IPC12_CNFIS_LENGTH                      0x00000002

#define _IPC12_CNFIP_POSITION                    0x0000000A
#define _IPC12_CNFIP_MASK                        0x00001C00
#define _IPC12_CNFIP_LENGTH                      0x00000003

#define _IPC12_CNGIS_POSITION                    0x00000010
#define _IPC12_CNGIS_MASK                        0x00030000
#define _IPC12_CNGIS_LENGTH                      0x00000002

#define _IPC12_CNGIP_POSITION                    0x00000012
#define _IPC12_CNGIP_MASK                        0x001C0000
#define _IPC12_CNGIP_LENGTH                      0x00000003

#define _IPC12_w_POSITION                        0x00000000
#define _IPC12_w_MASK                            0xFFFFFFFF
#define _IPC12_w_LENGTH                          0x00000020

#define _IPC13_SPI2EIS_POSITION                  0x00000008
#define _IPC13_SPI2EIS_MASK                      0x00000300
#define _IPC13_SPI2EIS_LENGTH                    0x00000002

#define _IPC13_SPI2EIP_POSITION                  0x0000000A
#define _IPC13_SPI2EIP_MASK                      0x00001C00
#define _IPC13_SPI2EIP_LENGTH                    0x00000003

#define _IPC13_SPI2RXIS_POSITION                 0x00000010
#define _IPC13_SPI2RXIS_MASK                     0x00030000
#define _IPC13_SPI2RXIS_LENGTH                   0x00000002

#define _IPC13_SPI2RXIP_POSITION                 0x00000012
#define _IPC13_SPI2RXIP_MASK                     0x001C0000
#define _IPC13_SPI2RXIP_LENGTH                   0x00000003

#define _IPC13_SPI2TXIS_POSITION                 0x00000018
#define _IPC13_SPI2TXIS_MASK                     0x03000000
#define _IPC13_SPI2TXIS_LENGTH                   0x00000002

#define _IPC13_SPI2TXIP_POSITION                 0x0000001A
#define _IPC13_SPI2TXIP_MASK                     0x1C000000
#define _IPC13_SPI2TXIP_LENGTH                   0x00000003

#define _IPC13_w_POSITION                        0x00000000
#define _IPC13_w_MASK                            0xFFFFFFFF
#define _IPC13_w_LENGTH                          0x00000020

#define _IPC14_U2EIS_POSITION                    0x00000000
#define _IPC14_U2EIS_MASK                        0x00000003
#define _IPC14_U2EIS_LENGTH                      0x00000002

#define _IPC14_U2EIP_POSITION                    0x00000002
#define _IPC14_U2EIP_MASK                        0x0000001C
#define _IPC14_U2EIP_LENGTH                      0x00000003

#define _IPC14_U2RXIS_POSITION                   0x00000008
#define _IPC14_U2RXIS_MASK                       0x00000300
#define _IPC14_U2RXIS_LENGTH                     0x00000002

#define _IPC14_U2RXIP_POSITION                   0x0000000A
#define _IPC14_U2RXIP_MASK                       0x00001C00
#define _IPC14_U2RXIP_LENGTH                     0x00000003

#define _IPC14_U2TXIS_POSITION                   0x00000010
#define _IPC14_U2TXIS_MASK                       0x00030000
#define _IPC14_U2TXIS_LENGTH                     0x00000002

#define _IPC14_U2TXIP_POSITION                   0x00000012
#define _IPC14_U2TXIP_MASK                       0x001C0000
#define _IPC14_U2TXIP_LENGTH                     0x00000003

#define _IPC14_I2C2BIS_POSITION                  0x00000018
#define _IPC14_I2C2BIS_MASK                      0x03000000
#define _IPC14_I2C2BIS_LENGTH                    0x00000002

#define _IPC14_I2C2BIP_POSITION                  0x0000001A
#define _IPC14_I2C2BIP_MASK                      0x1C000000
#define _IPC14_I2C2BIP_LENGTH                    0x00000003

#define _IPC14_w_POSITION                        0x00000000
#define _IPC14_w_MASK                            0xFFFFFFFF
#define _IPC14_w_LENGTH                          0x00000020

#define _IPC15_I2C2SIS_POSITION                  0x00000000
#define _IPC15_I2C2SIS_MASK                      0x00000003
#define _IPC15_I2C2SIS_LENGTH                    0x00000002

#define _IPC15_I2C2SIP_POSITION                  0x00000002
#define _IPC15_I2C2SIP_MASK                      0x0000001C
#define _IPC15_I2C2SIP_LENGTH                    0x00000003

#define _IPC15_I2C2MIS_POSITION                  0x00000008
#define _IPC15_I2C2MIS_MASK                      0x00000300
#define _IPC15_I2C2MIS_LENGTH                    0x00000002

#define _IPC15_I2C2MIP_POSITION                  0x0000000A
#define _IPC15_I2C2MIP_MASK                      0x00001C00
#define _IPC15_I2C2MIP_LENGTH                    0x00000003

#define _IPC15_w_POSITION                        0x00000000
#define _IPC15_w_MASK                            0xFFFFFFFF
#define _IPC15_w_LENGTH                          0x00000020

#define _IPC17_CTMUIS_POSITION                   0x00000018
#define _IPC17_CTMUIS_MASK                       0x03000000
#define _IPC17_CTMUIS_LENGTH                     0x00000002

#define _IPC17_CTMUIP_POSITION                   0x0000001A
#define _IPC17_CTMUIP_MASK                       0x1C000000
#define _IPC17_CTMUIP_LENGTH                     0x00000003

#define _IPC17_w_POSITION                        0x00000000
#define _IPC17_w_MASK                            0xFFFFFFFF
#define _IPC17_w_LENGTH                          0x00000020

#define _IPC18_DMA0IS_POSITION                   0x00000000
#define _IPC18_DMA0IS_MASK                       0x00000003
#define _IPC18_DMA0IS_LENGTH                     0x00000002

#define _IPC18_DMA0IP_POSITION                   0x00000002
#define _IPC18_DMA0IP_MASK                       0x0000001C
#define _IPC18_DMA0IP_LENGTH                     0x00000003

#define _IPC18_DMA1IS_POSITION                   0x00000008
#define _IPC18_DMA1IS_MASK                       0x00000300
#define _IPC18_DMA1IS_LENGTH                     0x00000002

#define _IPC18_DMA1IP_POSITION                   0x0000000A
#define _IPC18_DMA1IP_MASK                       0x00001C00
#define _IPC18_DMA1IP_LENGTH                     0x00000003

#define _IPC18_DMA2IS_POSITION                   0x00000010
#define _IPC18_DMA2IS_MASK                       0x00030000
#define _IPC18_DMA2IS_LENGTH                     0x00000002

#define _IPC18_DMA2IP_POSITION                   0x00000012
#define _IPC18_DMA2IP_MASK                       0x001C0000
#define _IPC18_DMA2IP_LENGTH                     0x00000003

#define _IPC18_DMA3IS_POSITION                   0x00000018
#define _IPC18_DMA3IS_MASK                       0x03000000
#define _IPC18_DMA3IS_LENGTH                     0x00000002

#define _IPC18_DMA3IP_POSITION                   0x0000001A
#define _IPC18_DMA3IP_MASK                       0x1C000000
#define _IPC18_DMA3IP_LENGTH                     0x00000003

