Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/include/proc/p32mk0512mcj048.h
#define _OFF162_VOFF_POSITION                    0x00000001
#define _OFF162_VOFF_MASK                        0x0003FFFE
#define _OFF162_VOFF_LENGTH                      0x00000011

#define _OFF167_VOFF_POSITION                    0x00000001
#define _OFF167_VOFF_MASK                        0x0003FFFE
#define _OFF167_VOFF_LENGTH                      0x00000011

#define _OFF169_VOFF_POSITION                    0x00000001
#define _OFF169_VOFF_MASK                        0x0003FFFE
#define _OFF169_VOFF_LENGTH                      0x00000011

#define _OFF170_VOFF_POSITION                    0x00000001
#define _OFF170_VOFF_MASK                        0x0003FFFE
#define _OFF170_VOFF_LENGTH                      0x00000011

#define _OFF171_VOFF_POSITION                    0x00000001
#define _OFF171_VOFF_MASK                        0x0003FFFE
#define _OFF171_VOFF_LENGTH                      0x00000011

#define _OFF172_VOFF_POSITION                    0x00000001
#define _OFF172_VOFF_MASK                        0x0003FFFE
#define _OFF172_VOFF_LENGTH                      0x00000011

#define _OFF173_VOFF_POSITION                    0x00000001
#define _OFF173_VOFF_MASK                        0x0003FFFE
#define _OFF173_VOFF_LENGTH                      0x00000011

#define _OFF174_VOFF_POSITION                    0x00000001
#define _OFF174_VOFF_MASK                        0x0003FFFE
#define _OFF174_VOFF_LENGTH                      0x00000011

#define _OFF175_VOFF_POSITION                    0x00000001
#define _OFF175_VOFF_MASK                        0x0003FFFE
#define _OFF175_VOFF_LENGTH                      0x00000011

#define _OFF176_VOFF_POSITION                    0x00000001
#define _OFF176_VOFF_MASK                        0x0003FFFE
#define _OFF176_VOFF_LENGTH                      0x00000011

#define _OFF177_VOFF_POSITION                    0x00000001
#define _OFF177_VOFF_MASK                        0x0003FFFE
#define _OFF177_VOFF_LENGTH                      0x00000011

#define _OFF178_VOFF_POSITION                    0x00000001
#define _OFF178_VOFF_MASK                        0x0003FFFE
#define _OFF178_VOFF_LENGTH                      0x00000011

#define _OFF182_VOFF_POSITION                    0x00000001
#define _OFF182_VOFF_MASK                        0x0003FFFE
#define _OFF182_VOFF_LENGTH                      0x00000011

#define _OFF183_VOFF_POSITION                    0x00000001
#define _OFF183_VOFF_MASK                        0x0003FFFE
#define _OFF183_VOFF_LENGTH                      0x00000011

#define _OFF184_VOFF_POSITION                    0x00000001
#define _OFF184_VOFF_MASK                        0x0003FFFE
#define _OFF184_VOFF_LENGTH                      0x00000011

#define _OFF185_VOFF_POSITION                    0x00000001
#define _OFF185_VOFF_MASK                        0x0003FFFE
#define _OFF185_VOFF_LENGTH                      0x00000011

#define _OFF230_VOFF_POSITION                    0x00000001
#define _OFF230_VOFF_MASK                        0x0003FFFE
#define _OFF230_VOFF_LENGTH                      0x00000011

#define _OFF238_VOFF_POSITION                    0x00000001
#define _OFF238_VOFF_MASK                        0x0003FFFE
#define _OFF238_VOFF_LENGTH                      0x00000011

#define _OFF239_VOFF_POSITION                    0x00000001
#define _OFF239_VOFF_MASK                        0x0003FFFE
#define _OFF239_VOFF_LENGTH                      0x00000011

#define _OFF240_VOFF_POSITION                    0x00000001
#define _OFF240_VOFF_MASK                        0x0003FFFE
#define _OFF240_VOFF_LENGTH                      0x00000011

#define _OFF245_VOFF_POSITION                    0x00000001
#define _OFF245_VOFF_MASK                        0x0003FFFE
#define _OFF245_VOFF_LENGTH                      0x00000011

#define _OFF246_VOFF_POSITION                    0x00000001
#define _OFF246_VOFF_MASK                        0x0003FFFE
#define _OFF246_VOFF_LENGTH                      0x00000011

#define _OFF247_VOFF_POSITION                    0x00000001
#define _OFF247_VOFF_MASK                        0x0003FFFE
#define _OFF247_VOFF_LENGTH                      0x00000011

#define _OFF249_VOFF_POSITION                    0x00000001
#define _OFF249_VOFF_MASK                        0x0003FFFE
#define _OFF249_VOFF_LENGTH                      0x00000011

#define _OFF250_VOFF_POSITION                    0x00000001
#define _OFF250_VOFF_MASK                        0x0003FFFE
#define _OFF250_VOFF_LENGTH                      0x00000011

#define _OFF251_VOFF_POSITION                    0x00000001
#define _OFF251_VOFF_MASK                        0x0003FFFE
#define _OFF251_VOFF_LENGTH                      0x00000011

#define _OFF252_VOFF_POSITION                    0x00000001
#define _OFF252_VOFF_MASK                        0x0003FFFE
#define _OFF252_VOFF_LENGTH                      0x00000011

#define _OFF254_VOFF_POSITION                    0x00000001
#define _OFF254_VOFF_MASK                        0x0003FFFE
#define _OFF254_VOFF_LENGTH                      0x00000011

#define _OFF255_VOFF_POSITION                    0x00000001
#define _OFF255_VOFF_MASK                        0x0003FFFE
#define _OFF255_VOFF_LENGTH                      0x00000011

#define _DMACON_DMABUSY_POSITION                 0x0000000B
#define _DMACON_DMABUSY_MASK                     0x00000800
#define _DMACON_DMABUSY_LENGTH                   0x00000001

#define _DMACON_SUSPEND_POSITION                 0x0000000C
#define _DMACON_SUSPEND_MASK                     0x00001000
#define _DMACON_SUSPEND_LENGTH                   0x00000001

#define _DMACON_ON_POSITION                      0x0000000F
#define _DMACON_ON_MASK                          0x00008000
#define _DMACON_ON_LENGTH                        0x00000001

#define _DMASTAT_DMACH_POSITION                  0x00000000
#define _DMASTAT_DMACH_MASK                      0x00000007
#define _DMASTAT_DMACH_LENGTH                    0x00000003

#define _DMASTAT_RDWR_POSITION                   0x0000001F
#define _DMASTAT_RDWR_MASK                       0x80000000
#define _DMASTAT_RDWR_LENGTH                     0x00000001

