Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/include/proc/p32mk0512mcj048.h
#define _PWMCON1_MTBS_POSITION                   0x00000003
#define _PWMCON1_MTBS_MASK                       0x00000008
#define _PWMCON1_MTBS_LENGTH                     0x00000001

#define _PWMCON1_PTDIR_POSITION                  0x00000004
#define _PWMCON1_PTDIR_MASK                      0x00000010
#define _PWMCON1_PTDIR_LENGTH                    0x00000001

#define _PWMCON1_DTCP_POSITION                   0x00000005
#define _PWMCON1_DTCP_MASK                       0x00000020
#define _PWMCON1_DTCP_LENGTH                     0x00000001

#define _PWMCON1_DTC_POSITION                    0x00000006
#define _PWMCON1_DTC_MASK                        0x000000C0
#define _PWMCON1_DTC_LENGTH                      0x00000002

#define _PWMCON1_ITB_POSITION                    0x00000009
#define _PWMCON1_ITB_MASK                        0x00000200
#define _PWMCON1_ITB_LENGTH                      0x00000001

#define _PWMCON1_ECAM_POSITION                   0x0000000A
#define _PWMCON1_ECAM_MASK                       0x00000C00
#define _PWMCON1_ECAM_LENGTH                     0x00000002

#define _PWMCON1_CLTSTAT_POSITION                0x0000000E
#define _PWMCON1_CLTSTAT_MASK                    0x00004000
#define _PWMCON1_CLTSTAT_LENGTH                  0x00000001

#define _PWMCON1_FLTSTAT_POSITION                0x0000000F
#define _PWMCON1_FLTSTAT_MASK                    0x00008000
#define _PWMCON1_FLTSTAT_LENGTH                  0x00000001

#define _PWMCON1_PWMHIEN_POSITION                0x00000013
#define _PWMCON1_PWMHIEN_MASK                    0x00080000
#define _PWMCON1_PWMHIEN_LENGTH                  0x00000001

#define _PWMCON1_PWMLIEN_POSITION                0x00000014
#define _PWMCON1_PWMLIEN_MASK                    0x00100000
#define _PWMCON1_PWMLIEN_LENGTH                  0x00000001

#define _PWMCON1_TRGIEN_POSITION                 0x00000015
#define _PWMCON1_TRGIEN_MASK                     0x00200000
#define _PWMCON1_TRGIEN_LENGTH                   0x00000001

#define _PWMCON1_CLIEN_POSITION                  0x00000016
#define _PWMCON1_CLIEN_MASK                      0x00400000
#define _PWMCON1_CLIEN_LENGTH                    0x00000001

#define _PWMCON1_FLTIEN_POSITION                 0x00000017
#define _PWMCON1_FLTIEN_MASK                     0x00800000
#define _PWMCON1_FLTIEN_LENGTH                   0x00000001

#define _PWMCON1_PWMHIF_POSITION                 0x0000001B
#define _PWMCON1_PWMHIF_MASK                     0x08000000
#define _PWMCON1_PWMHIF_LENGTH                   0x00000001

#define _PWMCON1_PWMLIF_POSITION                 0x0000001C
#define _PWMCON1_PWMLIF_MASK                     0x10000000
#define _PWMCON1_PWMLIF_LENGTH                   0x00000001

#define _PWMCON1_TRGIF_POSITION                  0x0000001D
#define _PWMCON1_TRGIF_MASK                      0x20000000
#define _PWMCON1_TRGIF_LENGTH                    0x00000001

#define _PWMCON1_CLIF_POSITION                   0x0000001E
#define _PWMCON1_CLIF_MASK                       0x40000000
#define _PWMCON1_CLIF_LENGTH                     0x00000001

#define _PWMCON1_FLTIF_POSITION                  0x0000001F
#define _PWMCON1_FLTIF_MASK                      0x80000000
#define _PWMCON1_FLTIF_LENGTH                    0x00000001

#define _IOCON1_OSYNC_POSITION                   0x00000000
#define _IOCON1_OSYNC_MASK                       0x00000001
#define _IOCON1_OSYNC_LENGTH                     0x00000001

#define _IOCON1_SWAP_POSITION                    0x00000001
#define _IOCON1_SWAP_MASK                        0x00000002
#define _IOCON1_SWAP_LENGTH                      0x00000001

#define _IOCON1_CLDAT_POSITION                   0x00000002
#define _IOCON1_CLDAT_MASK                       0x0000000C
#define _IOCON1_CLDAT_LENGTH                     0x00000002

#define _IOCON1_FLTDAT_POSITION                  0x00000004
#define _IOCON1_FLTDAT_MASK                      0x00000030
#define _IOCON1_FLTDAT_LENGTH                    0x00000002

#define _IOCON1_OVRDAT_POSITION                  0x00000006
#define _IOCON1_OVRDAT_MASK                      0x000000C0
#define _IOCON1_OVRDAT_LENGTH                    0x00000002

#define _IOCON1_OVRENL_POSITION                  0x00000008
#define _IOCON1_OVRENL_MASK                      0x00000100
#define _IOCON1_OVRENL_LENGTH                    0x00000001

#define _IOCON1_OVRENH_POSITION                  0x00000009
#define _IOCON1_OVRENH_MASK                      0x00000200
#define _IOCON1_OVRENH_LENGTH                    0x00000001

#define _IOCON1_PMOD_POSITION                    0x0000000A
#define _IOCON1_PMOD_MASK                        0x00000C00
#define _IOCON1_PMOD_LENGTH                      0x00000002

#define _IOCON1_POLL_POSITION                    0x0000000C
#define _IOCON1_POLL_MASK                        0x00001000
#define _IOCON1_POLL_LENGTH                      0x00000001

#define _IOCON1_POLH_POSITION                    0x0000000D
#define _IOCON1_POLH_MASK                        0x00002000
#define _IOCON1_POLH_LENGTH                      0x00000001

#define _IOCON1_PENL_POSITION                    0x0000000E
#define _IOCON1_PENL_MASK                        0x00004000
#define _IOCON1_PENL_LENGTH                      0x00000001

#define _IOCON1_PENH_POSITION                    0x0000000F
#define _IOCON1_PENH_MASK                        0x00008000
#define _IOCON1_PENH_LENGTH                      0x00000001

#define _IOCON1_FLTMOD_POSITION                  0x00000010
#define _IOCON1_FLTMOD_MASK                      0x00030000
#define _IOCON1_FLTMOD_LENGTH                    0x00000002

#define _IOCON1_FLTPOL_POSITION                  0x00000012
#define _IOCON1_FLTPOL_MASK                      0x00040000
#define _IOCON1_FLTPOL_LENGTH                    0x00000001

#define _IOCON1_FLTSRC_POSITION                  0x00000013
#define _IOCON1_FLTSRC_MASK                      0x00780000
#define _IOCON1_FLTSRC_LENGTH                    0x00000004

#define _IOCON1_CLMOD_POSITION                   0x00000018
#define _IOCON1_CLMOD_MASK                       0x01000000
#define _IOCON1_CLMOD_LENGTH                     0x00000001

