Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/include/proc/p32mk0512mcj048.h
#define _CFD1FLTOBJ17_SID11_POSITION             0x0000001D
#define _CFD1FLTOBJ17_SID11_MASK                 0x20000000
#define _CFD1FLTOBJ17_SID11_LENGTH               0x00000001

#define _CFD1FLTOBJ17_EXIDE_POSITION             0x0000001E
#define _CFD1FLTOBJ17_EXIDE_MASK                 0x40000000
#define _CFD1FLTOBJ17_EXIDE_LENGTH               0x00000001

#define _CFD1MASK17_MSID_POSITION                0x00000000
#define _CFD1MASK17_MSID_MASK                    0x000007FF
#define _CFD1MASK17_MSID_LENGTH                  0x0000000B

#define _CFD1MASK17_MEID_POSITION                0x0000000B
#define _CFD1MASK17_MEID_MASK                    0x1FFFF800
#define _CFD1MASK17_MEID_LENGTH                  0x00000012

#define _CFD1MASK17_MSID11_POSITION              0x0000001D
#define _CFD1MASK17_MSID11_MASK                  0x20000000
#define _CFD1MASK17_MSID11_LENGTH                0x00000001

#define _CFD1MASK17_MIDE_POSITION                0x0000001E
#define _CFD1MASK17_MIDE_MASK                    0x40000000
#define _CFD1MASK17_MIDE_LENGTH                  0x00000001

#define _CFD1FLTOBJ18_SID_POSITION               0x00000000
#define _CFD1FLTOBJ18_SID_MASK                   0x000007FF
#define _CFD1FLTOBJ18_SID_LENGTH                 0x0000000B

#define _CFD1FLTOBJ18_EID_POSITION               0x0000000B
#define _CFD1FLTOBJ18_EID_MASK                   0x1FFFF800
#define _CFD1FLTOBJ18_EID_LENGTH                 0x00000012

#define _CFD1FLTOBJ18_SID11_POSITION             0x0000001D
#define _CFD1FLTOBJ18_SID11_MASK                 0x20000000
#define _CFD1FLTOBJ18_SID11_LENGTH               0x00000001

#define _CFD1FLTOBJ18_EXIDE_POSITION             0x0000001E
#define _CFD1FLTOBJ18_EXIDE_MASK                 0x40000000
#define _CFD1FLTOBJ18_EXIDE_LENGTH               0x00000001

#define _CFD1MASK18_MSID_POSITION                0x00000000
#define _CFD1MASK18_MSID_MASK                    0x000007FF
#define _CFD1MASK18_MSID_LENGTH                  0x0000000B

#define _CFD1MASK18_MEID_POSITION                0x0000000B
#define _CFD1MASK18_MEID_MASK                    0x1FFFF800
#define _CFD1MASK18_MEID_LENGTH                  0x00000012

#define _CFD1MASK18_MSID11_POSITION              0x0000001D
#define _CFD1MASK18_MSID11_MASK                  0x20000000
#define _CFD1MASK18_MSID11_LENGTH                0x00000001

#define _CFD1MASK18_MIDE_POSITION                0x0000001E
#define _CFD1MASK18_MIDE_MASK                    0x40000000
#define _CFD1MASK18_MIDE_LENGTH                  0x00000001

#define _CFD1FLTOBJ19_SID_POSITION               0x00000000
#define _CFD1FLTOBJ19_SID_MASK                   0x000007FF
#define _CFD1FLTOBJ19_SID_LENGTH                 0x0000000B

#define _CFD1FLTOBJ19_EID_POSITION               0x0000000B
#define _CFD1FLTOBJ19_EID_MASK                   0x1FFFF800
#define _CFD1FLTOBJ19_EID_LENGTH                 0x00000012

#define _CFD1FLTOBJ19_SID11_POSITION             0x0000001D
#define _CFD1FLTOBJ19_SID11_MASK                 0x20000000
#define _CFD1FLTOBJ19_SID11_LENGTH               0x00000001

#define _CFD1FLTOBJ19_EXIDE_POSITION             0x0000001E
#define _CFD1FLTOBJ19_EXIDE_MASK                 0x40000000
#define _CFD1FLTOBJ19_EXIDE_LENGTH               0x00000001

#define _CFD1MASK19_MSID_POSITION                0x00000000
#define _CFD1MASK19_MSID_MASK                    0x000007FF
#define _CFD1MASK19_MSID_LENGTH                  0x0000000B

#define _CFD1MASK19_MEID_POSITION                0x0000000B
#define _CFD1MASK19_MEID_MASK                    0x1FFFF800
#define _CFD1MASK19_MEID_LENGTH                  0x00000012

#define _CFD1MASK19_MSID11_POSITION              0x0000001D
#define _CFD1MASK19_MSID11_MASK                  0x20000000
#define _CFD1MASK19_MSID11_LENGTH                0x00000001

#define _CFD1MASK19_MIDE_POSITION                0x0000001E
#define _CFD1MASK19_MIDE_MASK                    0x40000000
#define _CFD1MASK19_MIDE_LENGTH                  0x00000001

#define _CFD1FLTOBJ20_SID_POSITION               0x00000000
#define _CFD1FLTOBJ20_SID_MASK                   0x000007FF
#define _CFD1FLTOBJ20_SID_LENGTH                 0x0000000B

#define _CFD1FLTOBJ20_EID_POSITION               0x0000000B
#define _CFD1FLTOBJ20_EID_MASK                   0x1FFFF800
#define _CFD1FLTOBJ20_EID_LENGTH                 0x00000012

#define _CFD1FLTOBJ20_SID11_POSITION             0x0000001D
#define _CFD1FLTOBJ20_SID11_MASK                 0x20000000
#define _CFD1FLTOBJ20_SID11_LENGTH               0x00000001

#define _CFD1FLTOBJ20_EXIDE_POSITION             0x0000001E
#define _CFD1FLTOBJ20_EXIDE_MASK                 0x40000000
#define _CFD1FLTOBJ20_EXIDE_LENGTH               0x00000001

#define _CFD1MASK20_MSID_POSITION                0x00000000
#define _CFD1MASK20_MSID_MASK                    0x000007FF
#define _CFD1MASK20_MSID_LENGTH                  0x0000000B

#define _CFD1MASK20_MEID_POSITION                0x0000000B
#define _CFD1MASK20_MEID_MASK                    0x1FFFF800
#define _CFD1MASK20_MEID_LENGTH                  0x00000012

#define _CFD1MASK20_MSID11_POSITION              0x0000001D
#define _CFD1MASK20_MSID11_MASK                  0x20000000
#define _CFD1MASK20_MSID11_LENGTH                0x00000001

#define _CFD1MASK20_MIDE_POSITION                0x0000001E
#define _CFD1MASK20_MIDE_MASK                    0x40000000
#define _CFD1MASK20_MIDE_LENGTH                  0x00000001

#define _CFD1FLTOBJ21_SID_POSITION               0x00000000
#define _CFD1FLTOBJ21_SID_MASK                   0x000007FF
#define _CFD1FLTOBJ21_SID_LENGTH                 0x0000000B

#define _CFD1FLTOBJ21_EID_POSITION               0x0000000B
#define _CFD1FLTOBJ21_EID_MASK                   0x1FFFF800
#define _CFD1FLTOBJ21_EID_LENGTH                 0x00000012

#define _CFD1FLTOBJ21_SID11_POSITION             0x0000001D
#define _CFD1FLTOBJ21_SID11_MASK                 0x20000000
#define _CFD1FLTOBJ21_SID11_LENGTH               0x00000001

#define _CFD1FLTOBJ21_EXIDE_POSITION             0x0000001E
#define _CFD1FLTOBJ21_EXIDE_MASK                 0x40000000
#define _CFD1FLTOBJ21_EXIDE_LENGTH               0x00000001

